app/controllers/expenses_controller.rb

SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @expense = Expense.with_deleted.find(params[:id])

SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT 1  [["id", "3"]]
---
  def edit
    @expense = Expense.find(params[:id])

INSERT INTO "expenses" ("created_at", "household_id", "item_name", "note", "paid_in", "roommate_id", "settled", "split_evenly", "updated_at", "value") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    roommates = params[:expense][:roommate_expenses]
    params[:expense].delete :roommate_expenses
    @expense = Expense.create params[:expense]

SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT 1  [["id", "3"]]
UPDATE "expenses" SET "split_evenly" = 'f', "updated_at" = '2013-01-07 02:14:03.025014' WHERE "expenses"."id" = 3
---
  def update
    roommates = params[:expense][:roommate_expenses]
    params[:expense].delete :roommate_expenses
    @expense = Expense.find(params[:id])
    @expense.update_attributes params[:expense]