app/controllers/households_controller.rb

  def index
    @households = Household.all
---
SELECT "households".* FROM "households"

  def show
    @household = Household.find(params[:id])
---
SELECT "households".* FROM "households" WHERE "households"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @household = Household.new(params[:household])

    respond_to do |format|
      if @household.save
---
INSERT INTO "households" ("created_at", "nickname", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Sun, 06 Jan 2013 09:40:20 UTC +00:00], ["nickname", "asdgasga"], ["updated_at", Sun, 06 Jan 2013 09:40:20 UTC +00:00]]

  def destroy
    @household = Household.find(params[:id])
    @household.destroy
---
SELECT "households".* FROM "households" WHERE "households"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "households" WHERE "households"."id" = $1  [["id", 1]]