app/controllers/invites_controller.rb

INSERT INTO "invites" ("created_at", "fb_id", "open", "request_id", "roommate_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    invites = []
    params[:to].each do |fb_id|
      invites << Invite.create(
        fb_id: fb_id,
        request_id: params[:request],
        roommate_id: current_user.id
      )