app/controllers/sessions_controller.rb

  def create
    data = request.env['omniauth.auth']
    info = data[:info]
    fb_id = data[:uid]
    user = Roommate.find_by_fb_id(fb_id) rescue nil

    unless user
      user = Roommate.create(
        first_name: info[:first_name],
        last_name: info[:last_name],
        email: info[:email],
        fb_id: fb_id
      )
    end

    user.update_attributes(
      oauth_token: data[:credentials][:token],
      oauth_expiration: Time.at(data[:credentials][:expires_at])
    )

    set_current_user user

    if session[:request_ids]
      @invite = session[:request_ids].split(',').collect { |id|
        Invite.find_by_request_id id
---
SELECT "roommates".* FROM "roommates" WHERE "roommates"."fb_id" = '1223880007' LIMIT 1
INSERT INTO "roommates" ("created_at", "email", "fb_id", "first_name", "household_id", "last_name", "oauth_expiration", "oauth_token", "state", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
UPDATE "roommates" SET "oauth_token" = 'AAAH7Usy9pa8BAO4e3oYY4cNygAQbT5DNe35A5LCsWDeJ44ZCkoo6DTyvYGvfia7uib2lBQE4GfFzNTCZBtPABn0wmrAFyfZAuK30tJrXwZDZD', "oauth_expiration" = 1362639828, "updated_at" = '2013-01-06 07:49:44.838737' WHERE "roommates"."id" = 1
SELECT "invites".* FROM "invites" WHERE "invites"."request_id" = '106653282843463' LIMIT 1