app/controllers/sessions_controller.rb

SELECT "roommates".* FROM "roommates" WHERE "roommates"."email" = 'bennyjbergstein@gmail.com' LIMIT 1
---
  def create
    respond_to do |format|
      if params[:roommate]
        @user = Roommate.find_by_email(params[:roommate][:email])