app/controllers/users_controller.rb

SELECT "invites".* FROM "invites" WHERE "invites"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "invites" SET "open" = 'f', "updated_at" = '2013-01-07 00:32:24.544068' WHERE "invites"."id" = 1
SELECT "households".* FROM "households" WHERE "households"."id" = 2 LIMIT 1
SELECT "roommates".* FROM "roommates" WHERE "roommates"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "roommates" SET "state" = 'active', "household_id" = 2, "updated_at" = '2013-01-07 00:34:29.074104' WHERE "roommates"."id" = 2
---
  def update
    @user = User.find params[:id] rescue nil

    unless @user
      @user = current_user
    end

    if params[:invite]
      @invite = Invite.find params[:invite][:id] rescue nil
    end

    if @invite
      @invite.update_attribute :open, false
      @user.state = 'active'
    end

    if params[:roommate][:household_id]
      @household = Household.find params[:roommate][:household_id]
      @user.household = @household
    end

    respond_to do |format|
      if @user.update_attributes params[:roommate]