app/views/expenses/_form.html.haml

SELECT "households".* FROM "households" WHERE "households"."id" = 2 LIMIT 1
SELECT "roommates".* FROM "roommates" WHERE "roommates"."household_id" = 2
---
    = f.label 'by/from', class: 'pull-left'
    = f.input :roommate_id, collection: @expense.household.roommates.collect { |u| ["#{u.first_name} #{u.last_name}", u.id] }, wrapper_html: { class: 'pull-left' }, prompt: false, label: false