app/views/expenses/show.html.haml

SELECT "households".* FROM "households" WHERE "households"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "roommates" WHERE "roommates"."household_id" = 1
---
  = @expense.value
  = "split evenly #{@expense.household.roommates.count} ways" if @expense.split_evenly